In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique() #will return a numpy array of all unique values of column2

array([444, 555, 666], dtype=int64)

In [6]:
len(df['col2'].unique())

3

In [7]:
df['col2'].nunique() #will return number of all unique values of column2

3

In [8]:
df['col2'].value_counts() #will return count of all unique values of column2

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
df[df['col1']>2] #will return all the rows for which column2 is more than 2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [11]:
df[(df['col1']>2)&(df['col2']==444)] #using and operator for DataFrames

   col1  col2 col3
3     4   444  xyz

In [12]:
def times2(x):
    return x*2

In [13]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [14]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [15]:
lambda x:x*2

In [16]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [17]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [18]:
df.columns #return al  columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [19]:
df.index #will return all index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [23]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [22]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

In [24]:
df.dropna() #will drop rows of nan values

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Filling the nan values

In [25]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [26]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [27]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [28]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [29]:
df = pd.DataFrame(data)

In [30]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [31]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [47]:
s='dfgds hdfh'

In [48]:
y=list(s)
y

['d', 'f', 'g', 'd', 's', ' ', 'h', 'd', 'f', 'h']

In [49]:
x=2

In [50]:
y.append(2)

In [51]:
y

['d', 'f', 'g', 'd', 's', ' ', 'h', 'd', 'f', 'h', 2]

In [52]:
x=[]

In [53]:
type(x)

list

In [54]:
x=x.append(y)

In [55]:
x

In [30]:
'i' in x

True

In [31]:
y=2

In [32]:
x.append(y)

In [33]:

fh = 'But soft what light through yonder window breaks\nIt is the east and Juliet is the sun\nArise fair sun and kill the envious moon\nWho is already sick and pale with grief'
x=['i']
for line in fh:
    y=line.rstrip()
    z=y.split()
    for j in z:
        x=x.append(j)
y=sorted(x)
print(y)

AttributeError: 'NoneType' object has no attribute 'append'